{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__0", 
      "attrs": {"scalar": "31.875"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round0", 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip0", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast0", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "data_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__1", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round1", 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip1", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast1", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm0_gamma_mul_div_expand_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "batch_norm0_a_mul_data_quantized", 
      "inputs": [[5, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__0", 
      "attrs": {"scalar": "6"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm0_a_mul_data_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm0_a_mul_data_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "copy", 
      "name": "copy0", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm0_a_mul_data_cast_skip_add_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv20_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__2", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round2", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip2", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast2", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "resnetv20_conv0_weight_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "conv2d", 
      "name": "conv2d0", 
      "attrs": {
        "channels": "64", 
        "dilation": "(1, 1)", 
        "groups": "1", 
        "kernel_size": "[7, 7]", 
        "layout": "NCHW", 
        "out_dtype": "int32", 
        "padding": "(3, 3)", 
        "strides": "(2, 2)", 
        "use_bias": "False"
      }, 
      "inputs": [[17, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__1", 
      "attrs": {"scalar": "11"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "conv2d0_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d0_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d0_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__3", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round3", 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip3", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast3", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm1_gamma_mul_div_expand_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "batch_norm1_a_mul_data_quantized", 
      "inputs": [[28, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__2", 
      "attrs": {"scalar": "4"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm1_a_mul_data_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm1_a_mul_data_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm1_a_mul_data_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__4", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round4", 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip4", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast4", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm1_add_beta_expand_quantized_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "batch_norm1_out_quantized", 
      "inputs": [[40, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__3", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm1_out_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm1_out_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm1_out_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu0", 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "relu0_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu0_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "max_pool2d", 
      "name": "max_pool2d0", 
      "attrs": {
        "ceil_mode": "False", 
        "padding": "(1, 1)", 
        "pool_size": "[3, 3]", 
        "strides": "(2, 2)"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "max_pool2d0_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__5", 
      "attrs": {"scalar": "15.9375"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round5", 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip5", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast5", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm2_gamma_mul_div_expand_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "batch_norm2_a_mul_data_quantized", 
      "inputs": [[56, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__4", 
      "attrs": {"scalar": "3"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm2_a_mul_data_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm2_a_mul_data_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm2_a_mul_data_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__1", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__6", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round6", 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip6", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast6", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm2_add_beta_expand_quantized_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "batch_norm2_out_quantized", 
      "inputs": [[68, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__5", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm2_out_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm2_out_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm2_out_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu1", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "relu1_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu1_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu1_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv20_stage1_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__7", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round7", 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip7", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast7", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "resnetv20_stage1_conv0_weight_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "conv2d", 
      "name": "conv2d1", 
      "attrs": {
        "channels": "64", 
        "dilation": "(1, 1)", 
        "groups": "1", 
        "kernel_size": "[3, 3]", 
        "layout": "NCHW", 
        "out_dtype": "int32", 
        "padding": "(1, 1)", 
        "strides": "(1, 1)", 
        "use_bias": "False"
      }, 
      "inputs": [[83, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__6", 
      "attrs": {"scalar": "9"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "conv2d1_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d1_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d1_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__8", 
      "attrs": {"scalar": "63.75"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round8", 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip8", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast8", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm3_gamma_mul_div_expand_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "batch_norm3_a_mul_data_quantized", 
      "inputs": [[94, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__7", 
      "attrs": {"scalar": "5"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm3_a_mul_data_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm3_a_mul_data_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm3_a_mul_data_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__2", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__9", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round9", 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip9", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast9", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm3_add_beta_expand_quantized_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "batch_norm3_out_quantized", 
      "inputs": [[106, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__8", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm3_out_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm3_out_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm3_out_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu2", 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__3", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "relu2_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu2_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu2_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv20_stage1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__10", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round10", 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip10", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast10", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "resnetv20_stage1_conv1_weight_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "conv2d", 
      "name": "conv2d2", 
      "attrs": {
        "channels": "64", 
        "dilation": "(1, 1)", 
        "groups": "1", 
        "kernel_size": "[3, 3]", 
        "layout": "NCHW", 
        "out_dtype": "int32", 
        "padding": "(1, 1)", 
        "strides": "(1, 1)", 
        "use_bias": "False"
      }, 
      "inputs": [[122, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__9", 
      "attrs": {"scalar": "8"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "conv2d2_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d2_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d2_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "max_pool2d0_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add0_quantized", 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "elemwise_add0_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "elemwise_add0_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "elemwise_add0_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__11", 
      "attrs": {"scalar": "63.75"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round11", 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip11", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast11", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm4_gamma_mul_div_expand_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "batch_norm4_a_mul_data_quantized", 
      "inputs": [[138, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__10", 
      "attrs": {"scalar": "6"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm4_a_mul_data_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm4_a_mul_data_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm4_a_mul_data_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__4", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__12", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round12", 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip12", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast12", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm4_add_beta_expand_quantized_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "batch_norm4_out_quantized", 
      "inputs": [[150, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__11", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm4_out_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm4_out_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm4_out_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu3", 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__5", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "relu3_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu3_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu3_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv20_stage1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__13", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round13", 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip13", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast13", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "resnetv20_stage1_conv2_weight_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "conv2d", 
      "name": "conv2d3", 
      "attrs": {
        "channels": "64", 
        "dilation": "(1, 1)", 
        "groups": "1", 
        "kernel_size": "[3, 3]", 
        "layout": "NCHW", 
        "out_dtype": "int32", 
        "padding": "(1, 1)", 
        "strides": "(1, 1)", 
        "use_bias": "False"
      }, 
      "inputs": [[166, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__12", 
      "attrs": {"scalar": "8"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "conv2d3_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d3_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d3_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__14", 
      "attrs": {"scalar": "31.875"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round14", 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip14", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast14", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm5_gamma_mul_div_expand_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "batch_norm5_a_mul_data_quantized", 
      "inputs": [[177, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__13", 
      "attrs": {"scalar": "5"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm5_a_mul_data_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm5_a_mul_data_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm5_a_mul_data_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__6", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__15", 
      "attrs": {"scalar": "63.75"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round15", 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip15", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast15", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm5_add_beta_expand_quantized_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "batch_norm5_out_quantized", 
      "inputs": [[189, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__14", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm5_out_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm5_out_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm5_out_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu4", 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__7", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "relu4_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu4_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu4_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv20_stage1_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__16", 
      "attrs": {"scalar": "255.0"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round16", 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip16", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast16", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "resnetv20_stage1_conv3_weight_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "conv2d", 
      "name": "conv2d4", 
      "attrs": {
        "channels": "64", 
        "dilation": "(1, 1)", 
        "groups": "1", 
        "kernel_size": "[3, 3]", 
        "layout": "NCHW", 
        "out_dtype": "int32", 
        "padding": "(1, 1)", 
        "strides": "(1, 1)", 
        "use_bias": "False"
      }, 
      "inputs": [[205, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__15", 
      "attrs": {"scalar": "9"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "conv2d4_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d4_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d4_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "elemwise_add0_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1_quantized", 
      "inputs": [[216, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__16", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "elemwise_add1_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "elemwise_add1_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "elemwise_add1_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__17", 
      "attrs": {"scalar": "63.75"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round17", 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip17", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast17", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm6_gamma_mul_div_expand_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "batch_norm6_a_mul_data_quantized", 
      "inputs": [[222, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__17", 
      "attrs": {"scalar": "5"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm6_a_mul_data_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm6_a_mul_data_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm6_a_mul_data_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__8", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__18", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round18", 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip18", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast18", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm6_add_beta_expand_quantized_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "batch_norm6_out_quantized", 
      "inputs": [[234, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__18", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm6_out_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm6_out_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm6_out_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu5", 
      "inputs": [[245, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "relu5_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu5_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu5_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv20_stage2_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__19", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round19", 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip19", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast19", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "resnetv20_stage2_conv0_weight_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "conv2d", 
      "name": "conv2d5", 
      "attrs": {
        "channels": "128", 
        "dilation": "(1, 1)", 
        "groups": "1", 
        "kernel_size": "[3, 3]", 
        "layout": "NCHW", 
        "out_dtype": "int32", 
        "padding": "(1, 1)", 
        "strides": "(2, 2)", 
        "use_bias": "False"
      }, 
      "inputs": [[249, 0, 0], [255, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__19", 
      "attrs": {"scalar": "7"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "conv2d5_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[257, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d5_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d5_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__20", 
      "attrs": {"scalar": "63.75"}, 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round20", 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip20", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast20", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm7_gamma_mul_div_expand_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[265, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "batch_norm7_a_mul_data_quantized", 
      "inputs": [[260, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__20", 
      "attrs": {"scalar": "5"}, 
      "inputs": [[267, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm7_a_mul_data_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm7_a_mul_data_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm7_a_mul_data_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__9", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[271, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__21", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round21", 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip21", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast21", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm7_add_beta_expand_quantized_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "batch_norm7_out_quantized", 
      "inputs": [[272, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__21", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm7_out_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm7_out_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[281, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm7_out_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu6", 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "relu6_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu6_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[285, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu6_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv20_stage2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__22", 
      "attrs": {"scalar": "255.0"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round22", 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip22", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast22", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "resnetv20_stage2_conv1_weight_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "conv2d", 
      "name": "conv2d6", 
      "attrs": {
        "channels": "128", 
        "dilation": "(1, 1)", 
        "groups": "1", 
        "kernel_size": "[3, 3]", 
        "layout": "NCHW", 
        "out_dtype": "int32", 
        "padding": "(1, 1)", 
        "strides": "(1, 1)", 
        "use_bias": "False"
      }, 
      "inputs": [[287, 0, 0], [293, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__22", 
      "attrs": {"scalar": "9"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "conv2d6_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[295, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d6_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d6_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__10", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu5_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv20_stage2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__23", 
      "attrs": {"scalar": "127.5"}, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round23", 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip23", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast23", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "resnetv20_stage2_conv2_weight_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "conv2d", 
      "name": "conv2d7", 
      "attrs": {
        "channels": "128", 
        "dilation": "(1, 1)", 
        "groups": "1", 
        "kernel_size": "[1, 1]", 
        "layout": "NCHW", 
        "out_dtype": "int32", 
        "padding": "(0, 0)", 
        "strides": "(2, 2)", 
        "use_bias": "False"
      }, 
      "inputs": [[300, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__23", 
      "attrs": {"scalar": "6"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "conv2d7_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d7_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[309, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "conv2d7_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add2_quantized", 
      "inputs": [[299, 0, 0], [311, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__24", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "elemwise_add2_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[313, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "elemwise_add2_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "elemwise_add2_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__24", 
      "attrs": {"scalar": "63.75"}, 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round24", 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip24", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[319, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast24", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[320, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm8_gamma_mul_div_expand_quantized_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "batch_norm8_a_mul_data_quantized", 
      "inputs": [[316, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "__rshift_scalar__", 
      "name": "__rshift_scalar__25", 
      "attrs": {"scalar": "6"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm8_a_mul_data_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm8_a_mul_data_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[325, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm8_a_mul_data_cast_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "__lshift_scalar__", 
      "name": "__lshift_scalar__11", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "__mul_scalar__", 
      "name": "__mul_scalar__25", 
      "attrs": {"scalar": "63.75"}, 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "round", 
      "name": "round25", 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "clip25", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "cast25", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[332, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm8_add_beta_expand_quantized_cast", 
      "attrs": {"dtype": "int16"}, 
      "inputs": [[333, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "batch_norm8_out_quantized", 
      "inputs": [[328, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "batch_norm8_out_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[335, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm8_out_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "batch_norm8_out_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[337, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "relu7", 
      "inputs": [[338, 0, 0]]
    }, 
    {
      "op": "clip", 
      "name": "relu7_clip", 
      "attrs": {
        "a_max": "127", 
        "a_min": "-127"
      }, 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu7_cast", 
      "attrs": {"dtype": "int8"}, 
      "inputs": [[340, 0, 0]]
    }, 
    {
      "op": "cast", 
      "name": "relu7_cast_cast", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[341, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv20_stage2_conv3_weight", 
